Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །དཔྲལ་བའི་དབུས་སུ་ཐིག་ལེ་བྱས་ན་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་ཆེར་མཆོད་པར་འགྱུར་རོ།
en: If the vidyā holder makes a bindi mark between his eyebrows, he will be greatly honored by everyone in the world.

source: །མིད་པ་ལ་བྱུགས་ན་མགྲིན་སྔོན་བཞིན་དུ་བྲམ་ཟེ་ཐམས་ཅད་དབང་དུ་འགྱུར་ཞིང་བགྱི་བ་ཅི་མཆིས་ཞེས་བྲན་བཞིན་དུ་འགྱུར་རོ།
en: If he anoints his throat to resemble Nīlakaṇṭha, all the brahmins will fall under his thrall and serve him as his attendants.

source: །འོ་མ་དང་སྦྱར་ཏེ་མིག་ལ་བསྐུས་ན་མཚན་མོ་ཡང་ཉིན་མོ་བཞིན་དུ་སྣང་བར་འགྱུར་རོ། །གནོད་སྦྱིན་དང་སྲིན་པོའི་གནས་ཐམས་ཅད་ཀྱི་སྒོ་ཕྱེ་བར་འགྱུར་ཞིང་། གཏེར་ཐམས་ཅད་འབྱུང་བར་འགྱུར་རོ།
en: If he anoints his eyes with milk and incants them, he will be able to see at night as if it were daytime, all the residences of yakṣas and rākṣasas will appear open to him, and all treasure troves will be exposed. “

source: །ཐམས་ཅད་བྲན་བཞིན་བྱེད་པར་འགྱུར་ཀླུའི་གནས་ཀྱི་མཚོར་བོར་ན་ཀླུ་ཆེན་པོས་ཆར་གྱི་རྒྱུན་གཏོང་བར་འགྱུར་རོ།
en: If the vidyā holder throws the amulet into a pond inhabited by nāgas, the great nāgas will release torrents of rain.

source: །ཆར་ཧ་ཅང་ཆེ་བའི་ཚེ་ཆུ་དང་བསྲེས་ཏེ་ནམ་མཁའ་ལ་གཏོར་ན་ཞི་བར་འགྱུར་རོ།
en: If it rains too much, the vidyā holder should throw the amulet mixed with water toward the sky, and it will stop.

source: །སྤྲིན་ལ་བལྟས་ཏེ་སེར་བའི་རྒྱུན་ལ་གཏོར་ན་སེར་བ་འབབ་པར་མི་འགྱུར་རོ།
en: If he releases a stream of water in the direction of the cloud, hail will no longer fall.

source: །ལག་པ་ལ་བཏགས་ན་གང་ལ་རེག་པ་དེ་ཟད་མི་ཤེས་པར་འགྱུར་རོ།
en: If he ties the amulet to his hand, anything he touches will becomes inexhaustible.

source: །རྐང་པའི་རྗེ་ངར་ལ་བཏགས་ཏེ་མེའི་ནང་དུ་ཞུགས་ན་མེས་མི་ཚུགས་ཤིང་ཙནྡན་བཞིན་དུ་བསིལ་བར་འགྱུར་རོ།
en: If he ties the amulet to his calf, he will be able to walk into the midst of a fire without being burned, and he will feel as cool as sandalwood.

source: །རལ་གྲི་ལ་བྱུགས་ནས་གཡུལ་ངོར་སོང་ན་ལུས་ཐམས་ཅད་གཅིག་ཏུ་འབར་བར་གྱུར་ནས་ཕ་རོལ་གྱི་དཔུང་ཐམས་ཅད་འབྱེར་བར་འགྱུར་ཞིང་ཐམས་ཅད་དུ་རྒྱལ་བར་འགྱུར་རོ།
en: If he anoints his sword and enters battle, his whole body will be engulfed by flame, and the entire enemy army will flee. He will be completely victorious. “

source: །ནད་ཆེན་པོས་ཐེབས་པའི་ནད་པ་ཚབས་པོ་ཆེ་ལ་ཕྱེ་མ་བྱིན་ན་ནད་ཚབས་ཆེན་པོ་ལས་ཐར་བར་འགྱུར་རོ།
en: If the vidyā holder gives the powdered preparation to someone whose strength has been sapped by a serious illness, their weakness will fade away.

source: །ཕོ་བ་ན་བ་ལ་ཆུ་དྲོན་ལས་བཏང་ན་མོད་ལ་ཡོངས་སུ་ཐར་བར་འགྱུར་རོ།
en: Those who suffer from dysentery or seizures should be given hot water, and they will be instantly cured.

source: །རྩིབ་ལོགས་ན་བ་ལ་དར་བ་ལས་བཏང་ན་ཞི་བར་འགྱུར་རོ།
en: If it is spread on someone who suffers from pain in the side of their body, the pain will cease.

source: །ནད་ཐམས་ཅད་ལ་ནི་ཞུན་མར་དང་ཏིལ་མར་ལས་སྦྱར་ཏེ་བསྐུམ་ཉེ་དང་།
en: For any disease, the vidyā holder should combine the preparation with melted ghee and oil.

source: བཟའ་བ་དང་། བཏུང་བའི་ནད་དང་། སྣར་བླུགས་པ་དང་། བྱུག་པ་བྱས་ན་ནད་ཐམས་ཅད་འཇིག་པར་འགྱུར་ཞིང་ནམ་ཡང་འབྱུང་བར་མི་འགྱུར་རོ།
en: It can then be rubbed in, eaten, taken as a beverage, taken through the nose, or smeared on, and any disease will be cured and never recur. “

source: །ཕུག་གི་སྒོར་ཁོར་ཡུག་ཏུ་བྱུགས་ལ་སྙིང་པོ་ལན་བདུན་བཟླས་ཏེ། དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་རྒྱ་བྱས་ལ། ཁྲོ་བོའི་རྒྱལ་པོའི་གསང་སྔགས་ལན་ཅིག་བཟླས་བརྗོད་བྱས་ནས་ཞུགས་ན། ཕུག་གི་སྒོ་ཆག་སྟེ་རང་གི་ཁྱིམ་དུ་འགྱུར་ཞིང་སྡང་བ་ཐམས་ཅད་བཟློག་པར་འགྱུར་རོ།
en: If the vidyā holder smears the preparation around a secret entrance, recites the heart mantra seven times while displaying the mudrā of Amoghapāśa, and then recites the Krodharāja mantra once, he will be able to enter as if it were his own house.

source: །བགེགས་དང་ལོག་འདྲེན་ཐམས་ཅད་མི་སྣང་བར་འགྱུར་རོ།
en: All the locks will break apart, all hostile beings will be restrained, and all the vighnas and vināyakas will disappear.

source: །ཁར་བཅུག་སྟེ་མི་སྨྲ་བར་སྙིང་པོའི་མདོ་བརྗོད་པར་བྱས་ན། ལན་བརྒྱ་ཕྲག་སྟོང་བཟླས་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་དང་ལྡན་པར་འགྱུར་རོ།
en: If the vidyā holder holds the amulet in his mouth and mentally recites this heart sūtra of Amoghapāśa once, it will be the same as if he were to recite it one hundred thousand times, and he will possess roots of virtue equal to those of all tathāgatas. “

source: །ཤིང་རྟའི་སྲོག་ཤིང་ལ་བྱུགས་ན་གཡུལ་ངོ་ཐམས་ཅད་དུ་རྒྱལ་བ་ཐོབ་པར་འགྱུར་རོ།
en: If the vidyā holder anoints the axel of a chariot, he will find victory in any battle.

source: །ཟོང་ལ་གཏོར་ན་རིན་ཆེན་པོས་ཉོ་བར་འགྱུར་རོ།
en: If he sprinkles the preparation on merchandise, he will sell it for a large sum of money.

source: །བུ་མོའི་གདོང་བཀྲུས་ན་མགོ་ཡང་བར་འགྱུར་རོ།
en: If he sprinkles it onto a girl’s face, he will be able to carry her off.

source: །སྙིང་གར་ཐིག་ལེ་བྱས་ན་ཐམས་ཅད་དུ་བལྟར་མེད་པར་འགྱུར་རོ།
en: If he marks his chest with a bindi, he will be invisible everywhere he goes.

source: །ཐམས་ཅད་དུ་འདོད་པ་ཐམས་ཅད་སྦྱིན་པ་ལས་ཐམས་ཅད་བྱེད་པ་བདག་སྲུང་བ། གཞན་སྲུང་བའི་ནོར་བུ་གང་དང་གང་ལ་སྦུར་ཞིང་བཟླས་པས།
en: This great amulet completely fulfills all wishes, accomplishes whatever task it is employed for, and protects both oneself and others.

source: ཐམས་ཅད་དུ་བལྟར་མེད་པར་འགྱུར་རོ།
en: When combined with recitation, it will render the vidyā holder unassailable by vighnas and vināyakas.

source: །བགེགས་དང་ལོག་འདྲེན་རྣམས་ལ་ཏིལ་དང་ཆུ་ལ་ལན་བདུན་བཟླས་ཏེ་བྱིན་ན། བགེགས་དང་ལོག་འདྲེན་ཐམས་ཅད་ཞི་བར་འགྱུར་རོ།
en: If the vidyā holder incants sesame water seven times, all the vighnas and vināyakas will be pacified. “

source: །བྱུར་ངན་པ་མེད་པར་བྱ་ན་རས་ལ་དཀྱིལ་འཁོར་ཟླུམ་པོ་བྲིས་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྤྱན་སྔར་མི་སྨྲ་བར་བཟླས་བརྗོད་སྟོང་རྩ་བརྒྱད་བཟླས་ལ། མཆོད་པ་རྒྱ་ཆེན་པོ་བྱས་ཏེ།
en: To pacify ill luck, the vidyā holder should draw Noble Avalokiteśvara on a round piece of cloth and mentally recite the mantra in front of it one thousand and eight times while making extensive offerings.

source: གཙང་མས་གོས་གཙང་མ་བགོས་ཏེ། ཨ་ག་རུའི་བདུག་སྤོས་བདུག་པར་བྱ་ཞིང་། སྤོས་དང་ལྡན་པའི་ཏིལ་མར་གྱི་མར་མེ་བལྟམ་པར་བྱས་ན།
en: Ritually pure and wearing clean clothes, he should burn agarwood incense and light lamps with scented oil.

source: བཟླས་བརྗོད་བྱས་པ་ཙམ་གྱི་མོད་ལ་བྱུར་ངན་པ་ཐམས་ཅད་མེད་པར་འགྱུར་རོ། །དབུལ་བ་ཉམས་པའི་དོན་དང་།
en: As soon as he finishes the recitation, all his ill luck will be dispelled.

source: མ་གྲུབ་པ་དང་། སྡིག་པ་དང་རྨི་ལམ་ངན་པ་དང་། ལྟས་ངན་པ་དང་། སྒྲིབ་པ་བསལ་ན་གསེར་རམ་དངུལ་གྱི་བུམ་པ་སྤོས་ཆུས་བཀང་བ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ཏེ། བླུགས་ན་དེ་དག་ཐམས་ཅད་འཇིགས་པར་འགྱུར་ཞིང་།
en: To bring an end to poverty, to ward off failure, and to dispel evil, bad dreams, bad omens, and obscurations, the vidyā holder should fill a golden or silver jar with scented water, incant it one hundred and eight times, and sprinkle the water everywhere.

source: འཇིག་རྟེན་པའི་དཔལ་ཆེན་པོ་ཉམས་སུ་མྱོང་བར་འགྱུར་རོ།
en: All the above will be removed, and the vidyā holder will experience tremendous worldly affluence. “

source: །གདོན་ཐམས་ཅད་ཚར་བཅད་ན་ཏིལ་དང་འབྲས་སོ་བའི་སྦྱིན་སྲེག་གིས་སོ།
en: To exorcise all the grahas, the vidyā holder should offer a homa of sesame and rice.

source: །ནད་དང་གནོད་པ་ཐམས་ཅད་བསལ་ན་ཆུ་ལ་བཟླས་པས་སོ།
en: To cure all diseases and ailments, he should incant water and give it to the patient.

source: །དུས་མ་ཡིན་པར་འཆི་བ་ཞི་བར་བྱ་ན།
en: To prevent untimely death, he should recite the heart mantra one hundred times in full at the three times of the day.

source: དུས་གསུམ་དུ་ལན་གསུམ་གསུམ་དུ་རྟག་ཏུ་བཟླས་པས་དུས་མ་ཡིན་པར་འཆི་བ་ཞི་བར་འགྱུར་རོ།
en: This will ward off untimely death.

source: །བཅིངས་པ་དང་ལྕགས་སྒྲོག་དང་ཁོང་སྒྲིལ་གཞོམ་ན་ཉིན་རེ་ཞིང་བརྒྱ་རྩ་བརྒྱད་བཟླས་པས་སོ།
en: To break any fetters, shackles, or chains, he should recite the heart mantra one hundred and eight times every day.

source: །རྒྱལ་པོ་དབང་དུ་བྱ་ན་ལམ་པོ་ཆེར་བརྒྱ་རྩ་བརྒྱད་བཟླས་ན་རྒྱལ་པོ་འཁོར་དང་བཅས་པ་དབང་དུ་འགྱུར་རོ། །ཆོམ་པོ་དང་རྐུན་པོ་རེངས་པར་བྱ་ན།
en: To enthrall a king, he should recite the heart mantra one hundred and eight times on the royal road, and the king and his retinue will become enthralled. “

source: རཱ་ཛཱ་ཀོ་ཤཱ་ཀའི་ས་བོན་གྱི་སྦྱིན་སྲེག་གིས་སོ།
en: To paralyze thieves and bandits, the vidyā holder should offer a homa of rājakośātakī seeds.

source: །མེ་རེངས་པར་བྱ་ན་སེང་ལྡེང་གི་ཤིང་ལ་བཟླས་ཏེ་མེར་བཅུག་ནས་བཟླས་ན་མེ་རེངས་པར་བྱེད་པར་འགྱུར་རོ།
en: To extinguish a fire, he should incant cutch tree sticks and throw them into the fire. The fire will then be arrested.

source: །ཆུ་རེངས་པར་བྱ་ན་ཀ་ལ་ཀིའི་ས་བོན་ཆུའི་ནང་དུ་བཏབ་ན་ཆུ་རེངས་པར་བྱས་པར་འགྱུར་རོ།
en: To stop a flood, the vidyā holder should throw śalyakī into the water. The flood will then be arrested.

source: །དུག་གཞོམ་ན་རྨ་བྱའི་སྒྲོ་ཡིས་སོ།
en: Poison can be neutralized with an incanted peacock feather.

source: །མཚོན་རེངས་པར་བྱ་ན་ཤིང་གནམ་ལྕགས་ཀྱིས་ཚིག་པའི་ཐལ་བ་ལ་བཟླས་ཏེ་གཏོར་ན་མཚོན་ཆ་ཐམས་ཅད་རེངས་པར་འགྱུར་རོ།
en: To immobilize weapons, the vidyā holder should sprinkle them with the ashes from a tree burned by lightning. Any weapon will then be immobilized. “

source: །ཏིང་ངེ་འཛིན་བསྒྲུབས་ན་ཏིང་ངེ་འཛིན་གྱི་ཕྱག་རྒྱ་བཅིངས་ཏེ་བཟླས་ན་ཏིང་ངེ་འཛིན་སྟོང་ཐོབ་པར་འགྱུར་རོ།
en: To accomplish any type of samādhi, the vidyā holder should display the samādhi mudrā and recite the heart mantra. He will then attain one thousand samādhis.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་རྫོགས་པར་འདོད་པའི་རིག་སྔགས་འཆང་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་དེས་བ་ལང་གི་ལྕི་བས་དཀྱིལ་འཁོར་གྲུ་བཞི་བ་ཆ་ཤིན་ཏུ་མཛེས་པ་བྱས་ཏེ།
en: To fully accomplish the six perfections, a vidyā holder who is a monk, a nun, a male lay practitioner, or a female lay practitioner should use cow dung to make a symmetrical maṇḍala with four corners.

source: ཙནྡན་གྱིས་མཆོད་པར་བྱ་ཞིང་། གུར་གུམ་དང་། གླ་རྩི་དང་། ག་བུར་གྱིས་མཆོད་ནས་མེ་ཏོག་སྣ་ཚོགས་བཀྲམ་སྟེ།
en: He should worship it with the scents of sandalwood, saffron, musk, and camphor and strew it with various flowers.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མངོན་དུ་ཕྱོགས་པར་བཞག་ནས། བུམ་པ་སྤོས་ཆུས་བཀང་བ་བཞི་བཞག་ལ། མཆོད་ཡོན་གྱི་སྣོད་བཞི་དང་པོག་ཕོར་བཞི་སྤོས་ཆུའི་བུམ་པའི་དབུས་སུ་གཞག་པར་བྱ་ཞིང་། ཨ་ག་རུའི་བདུག་པ་དབུལ་བར་བྱའོ།
en: Noble Avalokiteśvara should be placed facing the vidyā holder and surrounded by four jars full of fragrant water, four dishes with the argha water, and four incense holders.

source: །བུམ་པའི་སྟེང་དུ་བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གཞག་པར་བྱ།
en: In the center of the maṇḍala, he should place a jar with scented water, and on top of this jar, a copy of the blessed Prajñāpāramitā adorned with all ornaments. “

source: རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པར་བྱ་ཞིང་སྤོས་ཀྱི་མར་མེ་བཞི་བལྟམ་པར་བྱ། མཆོད་པ་རྒྱ་ཆེན་པོ་བྱ།
en: The vidyā holder should then light four scented lamps, lay out abundant offerings, and adorn the maṇḍala with banners.

source: བ་དན་གྱིས་བརྒྱན་པར་བྱ་ཞིང་དཀྱིལ་འཁོར་བྱས་ལ་དཀྱིལ་འཁོར་གྱི་དབུས་སུ་སྐྱིལ་མོ་ཀྲུང་དུ་འདུག་སྟེ། བཟླས་བརྗོད་སྟོང་རྩ་བརྒྱད་བྱ།
en: He should sit with legs crossed in front of the maṇḍala and recite the heart mantra one thousand and ten times, the mantra of Krodharāja one hundred and eight times.

source: ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞིང་འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྐུ་སྟོན་པར་འགྱུར་རོ།
en: This will bring the full accomplishment of the six perfections.

source: །དགེ་བའི་རྩ་བའི་ཚོགས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Noble Prajñāpāramitā will appear, enabling the vidyā holder to accumulate the roots of every virtue.

source: །སེམས་ཅན་བརྒྱ་སྟོང་མང་པོ་གདུལ་ན་རིའི་རྩེ་མོར་སྟོང་རྩ་བརྒྱད་བཟླས་པས་སོ།
en: The vidyā holder will be able to guide many hundreds of thousands of beings by reciting the mantra one thousand and eight times on top of a mountain. “

source: །སྡང་བ་ཐམས་ཅད་གཞོམ་པར་འདོད་པས་རྡོ་རྗེའམ་མདུང་རྩེ་གསུམ་ལ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་ཏེ།
en: If the vidyā holder wants to destroy all māras and hostile beings, he should incant a vajra or a trident one thousand and eight times.

source: དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་རྒྱས་ཚམ་ངམ་བྱ་ཞིང་ཁྲོ་བོའི་རྒྱལ་པོའི་བསྡིགས་པའི་ཕྱག་རྒྱ་བཅིངས་ཏེ་ཁྲོས་པས་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ནས།
en: He will cause them to tremble by displaying the mudrā of Amoghapāśa and bind them using the threatening mudrā of Krodharāja.

source: གསོར་ཏེ་ནམ་མཁའ་ལ་འཕངས་ན་བདུད་ལ་སོགས་པ་སྡང་བ་ཐམས་ཅད་བཅོམ་པར་འགྱུར་རོ།
en: Angrily incanting the vajra or trident twenty-one times, he should throw it into the sky. Propelled in such a way, it will crush all wicked beings, the māras and so forth. “

source: །ལས་ཐམས་ཅད་གྲུབ་བ་དང་གསང་སྔགས་ཐམས་ཅད་འགྲུབ་པ་དང་བསམ་པ་ཐམས་ཅད་འགྲུབ་ཅིང་ཡོངས་སུ་རྫོགས་པར་འདོད་པས་དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་རྒྱ་བཅིངས་ཏེ་སྟོང་ཉི་ཤུ་བཟླས་ན་གྲུབ་པ་ཆེན་པོར་འགྱུར་རོ།
en: If the vidyā holder wants to accomplish all activities and all mantras, and if he wishes to attain the complete fulfillment of all he desires, he should display the mudrā of Amogharāja and recite the mantra one thousand and twenty times. This will result in great accomplishment.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་དབང་བསྐུར་བར་འདོད་པས་སྟོང་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་བཟླས་ན།
en: If he wants to be consecrated by all the tathāgatas, he should recite the mantra one thousand and thirty-two times.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དབང་བསྐུར་བར་འགྱུར་ཏེ། དེ་བཞིན་དུ་སྤོས་ཆུའི་བུམ་པས་དབང་བསྐུར་བར་བྱའོ།
en: If he then sprinkles himself with the scented water from the vase, he will be consecrated by all the tathāgatas. “

source: །དེ་བཞིན་གཤེགས་པའི་གཟུགས་བརྙན་སྐུ་གདུང་དང་བཅས་པ་ལ་མིག་གཏད་དེ་ཁྲི་བཟླས་ན་དེ་བཞིན་གཤེགས་པ་ཉིད་འཐོབ་པར་འགྱུར་རོ།
en: If the vidyā holder recites the mantra ten thousand times while gazing at a statue of the Tathāgata that contains relics, he will himself become a tathāgata.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞབས་མནན་ཏེ་ཁྲི་བཟླས་ན་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་འདྲ་བར་འགྱུར་རོ།
en: If he plants the vajra or trident at the feet of Noble Avalokiteśvara and recites the mantra ten thousand times, he will become like Noble Avalokiteśvara.

source: །ཕྱག་ན་རྡོ་རྗེ་སྤྱན་དྲང་བར་འདོད་པས། ཕྱག་ན་རྡོ་རྗེའི་ཞབས་མནན་ཏེ་བཟླས་བརྗོད་ལན་སྟོང་བྱས་ནས། གུ་གུལ་གྱི་བདུག་པ་དབུལ་བ་བྱས་ན།
en: If he wants to summon Vajrapāṇi, he should plant it at the feet of an image of Vajrapāṇi and recite the mantra one thousand times while burning bdellium incense.

source: འཕགས་པ་ཕྱག་ན་རྡོ་རྗེ་རང་གི་སྐུ་གཟུགས་ཀྱིས་མདུན་ན་འདུག་པར་འགྱུར་རོ།
en: Noble Vajrapāṇi will then appear before the vidyā holder in person. “

source: །ཐམས་ཅད་དུ་ཁྲོ་བོའི་རྒྱལ་པོ་དྲན་པར་བྱ་ཞིང་ཐམས་ཅད་དུ་དོན་ཡོད་པའི་ཞགས་པའི་ཕྱག་རྒྱ་བཅིང་བ་བྱས་ན།
en: The mantra of Krodharāja can be mentally recited and the mudrā of Amoghapāśa displayed in any context, and even that which had not previously been accomplished or previously recited will be accomplished.

source: མ་བསྒྲུབས་མ་བཀླགས་པར་འགྲུབ་ཅིང་ཆོ་ག་ཞིབ་མོ་མཐའ་ཡས་པ་འགྲུབ་པར་འགྱུར་རོ།
en: Using them, the practitioner can accomplish innumerable rites.

source: །སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་དང་། ངོ་ཚ་སེས་པ་དང་། བརྩེ་བ་དང་།
en: His accomplishment will be indicated by his qualities of compassion, sympathetic joy, equanimity, a sense of shame, pity, loving kindness, and insight.

source: བྱམས་པ་དང་། ཤེས་རབ་དང་ལྡན་པས་འདི་འགྲུབ་པར་བསྟན་ཏོ། །གོ་ཆ་བགོས་པ་འགྲུབ་པ་མཆོག་ཐམས་ཅད་གྲུབ་པ་ཐོབ་ཅིང་བསོད་ནམས་ཀྱི་ཕུང་པོས་འབར་བར་འགྱུར་རོ།
en: He will attain complete success in armor and other rites, and he will shine with his accumulated great merit. “

source: །ཐོག་མར་ཁྲོ་བོའི་རྒྱལ་པོ་བཟླས་པས་རྟག་ཏུ་མཚམས་བཅད་པ་དང་ཕྱོགས་བཅིང་བ་དང་ཡུལ་བཅིང་བ་བྱས་ཏེ་སྲུང་བ་མཆོག་ཏུ་དཀོན་པའོ།
en: By first reciting the Krodharāja mantra, the vidyā holder will always create a protection circle and bind the directions, the region, and the maṇḍala.

source: །དེ་བཞིན་གཤེགས་པ་དང་རྒྱལ་བའི་བདག་ཉིད་སྐྱེས་པ་ཐམས་ཅད་ཀྱིས་དབང་བསྐུར་བར་འགྱུར་ཞིང་།
en: This is an exceedingly rare rite of protection, one through which he will be consecrated by all tathāgatas and their heirs and gain the protective armor. Consecrated thus to always succeed in every rite, and knowing the samaya, he will easily obtain the complete accomplishment of Amogharāja and gain comfort and encouragement. The lokeśa Padmapāṇi will grant him boons.

source: གོ་ཆ་བགོས་པར་འགྱུར་རོ།
en: He should therefore always recite the Krodharāja mantra.

source: །གལ་ཏེ་དབང་བསྐུར་བར་འདོད་ན་ཡང་རྒྱལ་བ་ཐམས་ཅད་ཀྱིས་དབང་བསྐུར་བར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པས་བདེན་པ་སྟོན་པར་འགྱུར་རོ།
en: If he desires consecration, all the tathāgata victors who know the truth will consecrate him. “

source: །དོན་ཡོད་པའི་རྒྱལ་པོའི་ཆོ་ག་ཞིབ་མོ་མཆོག་ལས་ཁྲོ་བོའི་རྒྱལ་པོ་བཤད་པར་བྱ་སྟེ།
en: Now I will teach the mantra of Krodharāja, supreme among the sovereign rites of Amoghapāśa.

source: གཙང་མས་གོས་གཙང་མ་བགོས་ལ། ཤེས་རབ་དང་བྱང་ཆུབ་ཀྱི་ཐབས་དང་ལྡན་པས་འདི་འགྲུབ་པར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ལུང་བསྟན་ཏོ། །ནམཿསརྦ་ཏ་ཐཱ་ག་ཏ།
en: The vidyā holder should be ritually pure, wear clean clothes, and possess insight and realization. The following accomplishment and means has been prophesied by all tathāgatas. “

source: ཨཱརྱཱ་པ་ལོ་ཀི་ཏེ་ཤྭ་ར་བཛྲ་དྷ་རེ་བྷྱཿ ཨོཾ་ཙ་ར་ཙ་ར།
en: Homage to all the tathāgatas, and to Noble Avalokiteśvara and Vajradhara! [

source: ཙུ་རུ་ཙུ་རུ། མ་ཧཱ་ཀཱ་རུ་ཎི་ཀ །ཙི་རི་ཙི་རི། བི་རི་བི་རི།
en: 168] “Oṁ, cara cara, curu curu, O most compassionate!

source: མ་ཧཱ་པདྨ་ཧ་སྟ། ཀ་ལ་ཀ་ལ། ཀུ་ལུ་ཀུ་ལུ། མ་ཧཱ་སྠཱམ་པྲཱ་པ་ཏ།
en: Ciri ciri, biri biri, O great one with a lotus in your hand!

source: ཙ་ར་ཙ་ར། ཙ་ཙ་རི་ཏ། ཙ་རེ་ཤྭ་ར། ཨེ་ཧྱེ་ཧི། སིདྷྱ་སིདྷྱ།
en: Kala kala, kulu kulu, you of great tenacity!

source: བུདྷྱ་བུདྷྱ། དྷཱ་བ་དྷཱ་བ། ཀི་ཎི་ཀི་ཎི། པར་མ་ཤུད་དྷ་ས་ཧྭ།
en: Cara cara, cara cara, O Lord of the creatures of the night!

source: ཀ་ར་ཀ་ར། ཀི་རི་ཀི་རི། ཀུ་རུ་ཀུ་རུ།
en: Come, come!

source: མ་ཧཱ་པ་ཤུ་པ་ཏི་བེ་ཥ་དྷ་ར། ཧ་ཧཱ་ཧི་ཧཱི་ཧུ་ཧཱུ།
en: Grant accomplishment, grant!

source: ཨོཾ་ཀཱ་ར་མ་ཧཱ་བྲཧྨ་བེ་ཥ་དྷ་ར། ཙ་ར་ཙ་ར། བ་ར་བ་ར། ས་སྨི་ཤ་ཏ་ས་ཧ་སྲ་པྲ་ཏི་མཎྜི་ཏ་ཤ་རཱི་ར།
en: Awaken, awaken!

source: ཛྭ་ལ་ཛྭ་ལ། ཏ་པ་ཏ་པ། བྷ་ག་བཱ་ན།
en: Cleanse, cleanse!

source: སཽ་མཱ་དི་ཏྱ། ཡ་མ་བ་རུ་ཎ། ཀུ་བེ་ར། བྲཧྨེན་དྲ།
en: Kiṇi kiṇi, O supremely pure being!

source: རྀ་ཥི་ག་ཎ། དེ་བག་ཎཱ་བྷྱརྩི་ཏ་ཙ་ར་ཎ། སུ་རུ་སུ་རུ། མུ་རུ་མུ་རུ། ས་ནད་ཀུ་མཱ་ར།
en: Kara kara, kiri kiri, kuru kuru, O wearer of the garb of the great Paśupati!

source: རུ་དྲ། བིཥྞུ་བཱ་ས་བ། དྷ་ན་དཱ། དེ་བ་རྀ་ཥི་ནཱ་ཡ་ཀ །
en: Hā hā, hī hī, hū hū, O wearer of the garb of Oṁkāra Brahmā!

source: བ་ཧུ་བི་བི་དྷ་བེ་ཥ་དྷ་ར།
en: Sara sara, vara vara, you with the body adorned with hundreds of thousands of beautiful rays of light!

source: དྷ་ར་དྷ་རས་མན་ཏྲ་བ་ལོ་ཀཱ། བི་ལོ་ཀི་ཏེ།
en: Blaze, blaze, heat up, heat up, O Lord whose feet are worshiped by Soma, Āditya, Yama, Varuṇa, Kubera, Brahmā, Indra, and the hosts of ṛṣis and gods!

source: ལོ་ཀེ་ཤྭ་ར། མུ་ཡ་མུ་ཡ། མུཉྩ་མུཉྩ། བན་དྷ་བན་དྷ་ན།
en: Suru suru, muru muru, O leader of sages and gods such as Sanatkumāra, Rudra, Viṣṇu, Vāsava, and Dhanada!

source: ཏཱ་ཌ་ན། ཏ་རྫ་ན།
en: You wear many garbs!

source: རཱ་ཛ་ཏ་སྐ་ར། ཨག་ནི། ཨུ་དཀ །
en: Wear, wear!

source: བི་ཥ་ཤ་སྟྲ་པ་རི་མོ་ཙ་ཀ །
en: You, the great boon-granting lokeśvara lord with panoptic vision!

source: ཀ་ཎ་ཀ་ཎ།
en: Muya muya, save, save, O savior from killings, imprisonment, beatings, abuses by kings, bandits, fires, floods, poison, and weapons!

source: བ་ལ་བོ་དྷྱཾ་ག་ཙ་རུ་ཏཱ་རྱ་ས་ཏྱ་ས་མ་པྲ་ཀཱ་ཤ་ཀ །
en: Kaṇa kaṇa, O teacher of the strengths, the limbs of awakening, and the four truths of the noble ones!

source: ཏ་མ་ཏ་མ། ས་མ་ས་མ།
en: Tame, tame!

source: མ་ཧཱ་ཙི་ཏྱན་དྷྱ་ཀཱ་ར་པྲ་ཤ་མན་མི་ལི་མི་ལི།
en: Pacify, pacify, O great pacifier and remover of the darkness of ignorance!

source: ཨེ་ཎེ་ཡ་ཙརྨ་ཀྲྀ་ཏ་པ་རི་ཀ་ར།
en: Mili mili, O wearer of a sash made from the skin of black antelope!

source: མ་ཊ་མ་ཊ། བི་ཤུད་དྷ་བི་ཥ་ཡ་ནི་བཱ་སི་ནམ་ཧཱ་ཀཱ་རུ་ཎི་ཀ །
en: Maṭa maṭa, O compassionate one who abides in the pure realm!

source: ཤྭེ་ཏ་ཡཛྙོ་བ་བཱི་ཏ། རཏྣ་མ་ཀུ་ཊ་མཱ་ལཱ་དྷ་ར།
en: You wear a white sacred thread, a jewel diadem, and a rosary!

source: སརྦ་ཛྙཱ་ཤི་ར་སི་ཀྲྀ་ཏ། ཀ་ར་པུ་ཊ་དྷ་ན།
en: Your head is crowned with the omniscient one, and your hands are cupped!

source: ས་མཱ་དྷི།
en: You, the unshakeable one, produce meditative absorption, one-pointed concentration, and liberation!

source: བི་མོ་ཀྵ་ཨ་པྲ་ཀཾ་པྱ།
en: You help accomplish the six perfections and bring the mindstreams of many beings to maturity!

source: ཥཊ་པཱ་ར་མི་ཏཱ་པ་རི་པཱུ་ར་ཀ །
en: You crush all the wicked ones, including all māras!

source: བ་ཧུ་སཏྭ་སན་ཏ་ཏི་བ་རི་པཱ་ཙ་ཀ །
en: You grant every accomplishment and fulfill every hope!

source: སརྦ་མཱ་རཱ་དི་པྲ་དུཥྚ་པྲ་མཪྡཀ །སརྦ་སིང་དྷྱཱ་ཤཱ་པའི་པཱུ་ར་ཀ །
en: Please consecrate me, O Blessed Amogharāja!

source: ཨ་བྷི་ཥིཉྩ་སརྦ་ཏ་ཐཱ་ག་ཏ།
en: Grant me the empowerment of all the tathāgatas!

source: ཨ་བྷི་ཥེ་ཀཻ་ར། བྷ་ག་བཱ་ན་ཏ།
en: Hūṁ phaṭ!

source: ཨ་མོ་གྷ་རཱ་ཛ་ཧཱུཾ་ཕཊ།
en: Homage be to you!

source: ན་མོ་སྟུ་ཏེ་སྭཱ་ཧཱ།
en: Svāhā! “

source: གསང་སྔགས་ཀྱི་ཆོ་ག་སྔ་མ་དེ་ལྟ་བུས་ལས་ཐམས་ཅད་པ་དོན་ཡོད་པའི་ཞགས་པ་ཁྲོ་བོ་ཞེས་བྱ་བ་གྲུབ་པ་མཆོག་ལས་ཐམས་ཅད་པའོ།
en: This mantra, employed the same way as the previous one, is suitable for all activities. It is called Wrathful Amoghapāśa and is supremely effective in all activities. “

source: །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ།
en: The mantra of summoning: “Homage to the Three Jewels!

source: ན་མ་ཨཱརྱ་ཨ་མི་ཏཱ་བྷཱ་ཡ་ཏ་ཐཱ་ག་ཏཱ་ཡ།
en: Homage to the noble Tathāgata Amitābha!

source: ན་མ་ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་ཏྭཱ་ཡ།
en: Homage to the great bodhisattva being, Noble Avalokiteśvara of great compassion, the one who grants the boons of Amogha, the pure being with the noose in his hand! [

source: བོ་དྷི་སཏྭཱ་ཡ། མ་ཧཱ་སཏྭཱ་ཡ།
en: 169] “Come, come, O Lord!

source: མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ་ཡ། ཨ་མོ་གྷ་བ་ར་ད་པ་ཤ་ཧ་སྟཱ་ཡ།
en: You, with the lotus in your hand, whose fingers form the boon-granting gesture!

source: མ་ཧཱ་ཤུད་དྷ་ས་ཏྭཱ་ཡ། ཨཱ་གཙྪ། བྷ་ག་བཱ་ན། བྷ་བ་བཱན། པདྨ་ཧ་སྟ།
en: You, with the lotus-like arm, who wear the garb of the great Paśupati!

source: བ་ར་ད་ཀ་རཱཾ་གུ་ལེ།
en: Please be kind and arrive soon!

source: པདྨ་བྷུ་ཛཻ།
en: You move with great speed, adorned with light rays!

source: མ་ཧཱ་པ་ཤུ་པ་ཏི། བེ་ཥ་དྷ་རེ། པྲ་སཱི་ཏ་ཤཱི་གྷ་མཱ་གཙྪ།
en: Laugh, laugh, O pure amogha being!

source: མ་ཧཱ་བི་ག །བི་བྷ་ཥི་ཏ་རཥྨི། ཧ་ས་ཧ་ས།
en: Move, move!

source: ཨ་མོ་གྷ་ཤུད་དྷེ། ས་ཧ་ས་ཧ། ཙ་ལ་ཙ་ལ།
en: Proceed, proceed!

source: ཨཱ་གཙྪ། ཨཱ་གཙྪ། བྷ་ག་བཱ་ན།
en: Come, come, O Blessed Avalokiteśvara!

source: ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་རེ།
en: Accept these fragrant flowers I have gathered!

source: མ་མ་གན་དྷ་པུཥྤ་ས་མ་མརྫ་ནི།
en: Svāhā to you, Unfailing Accomplishment through the truth of the Three Jewels! “

source: ཨ་མ་པྲ་ཏཱིཙྪ།
en: This mantra effects summoning.

source: ཏྲི་རཏྣ་ས་ཏྱེ་ན།
en: The vidyā holder should recite it twenty-one times while burning incense of agarwood.

source: ཨ་མོ་གྷ་སིད་དྷེ་སྭཱ་ཧཱ། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་དཀྱིལ་འཁོར་ན་གནས་པ་ཐམས་ཅད་དགུག་པ་ཨ་ག་རུའི་བདུག་པ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་པ་བྱའོ།
en: This mantra is for the summoning of Noble Avalokiteśvara, who inhabits every maṇḍala. “

source: ན་མ་ཨཱརྱ་ཨ་བ་ལོ་ཀི་ཏེ་ཤྭ་རཱ་ཡ།
en: Homage to the great bodhisattva being, Noble Avalokiteśvara of great compassion, perfumed with all fragrances, who grants boons with his amogha arms! [

source: བོ་དྷི་ས་ཏྭཱ་ཡ།
en: 170] “You are delightfully adorned with fragrant garlands and beautified by the crescent moon on your head.

source: མ་ཧཱ་ས་ཏྭཱ་ཡ།
en: Please accept these fragrances, flowers, and scented unguents from me!

source: མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ་ཡ། སརྦ་གན་དྷཱ་དྷི་བ་སི་ཏ།
en: Vara vara, O boon granter!

source: ཨ་མོ་གྷ་བྷུ་ཛ། བ་ར་དཱ་ཡ། སརྦ་གན་དྷ་མཱ་ལྱ།
en: Svāhā! “

source: བི་བྷཱུ་ཥི་ཏ་པྲི་ཡེ། ཙཎ་ཌརྡྷཱ་ཤི་ར་སི་པྲི་ཡེ། གན་དྷ་ག་ན་དྷཱ་ནུ་ལེ་པ་ན་སཱ་མ་མ་པྲ་ཏཱིཙྪ། བ་ར་བ་ར་བ་ར་དཱ་ཡ་སྭཱ་ཧཱ། ལན་བདུན་བཟླས་ཏེ་དབུལ་བར་བྱའོ།
en: The fragrances offered should be incanted with this mantra seven times. “

source: ན་མཿཨཱརྱ་ཡ་བ་ལོ་ཀི་ཏེ་ཤྭ་ཏཱ་ཡ།
en: Homage to the great bodhisattva being, Noble Avalokiteśvara of great compassion! [

source: བོ་དྷི་སཏྭ་ཡ།
en: 171] “Hili hili, mili mili, O great luminous and immaculate one who wears the garb of Brahmā and grants the boon of kind disposition!

source: མ་ཧཱ་ས་ཏྭཱ་ཡ། མ་ཧཱ་ཀཱ་རུ་ཎི་ཀཱ་ཡ།
en: Turu turu, O one adorned with colorful garlands!
